# -*- coding: utf-8 -*-
import tushare as ts

REPORT_CATEGORY = ['季度报告-业绩报告', '中期报告-业绩报告', '年度报告-业绩报告', '业绩预报-业绩报告',
                   '业绩快报-业绩报告', '招股说明书-首发公告', '发行公告-首发公告', '路演公告-首发公告',
                   '招股意向书-首发公告', '定价公告-首发公告', '受限股上市-股份变动', '配股上市-股份变动',
                   '公积金转增-股份变动', '持股变动-股权变动', '股权变动-股权变动', '股权收购-股权变动',
                   '要约收购-股权变动', '吸收合并-股权变动', '减资公告-股权变动', '增发预案-增发公告',
                   '增发或准-增发公告', '增发招股意向书-增发公告', '发行公告-增发公告', '上市公告-增发公告',
                   '激励计划-股权激励', '对象名单-股权激励', '进展公告-股权激励', '配股预案-配股公告',
                   '股权说明书-配股公告', '风险警示-上市资格', '暂停上市-上市资格', '恢复上市-上市资格',
                   '终止上市-上市资格', '关联交易', '资产重组', '诉讼仲裁', '高管变动', '债券相关', '政府补贴',
                   '违纪违规', '担保事项', '项目投资', '股价异动', '重大合同', '重大损失', '其他公告']

REPORT_TYPE = ['其他', '补充及更正', '上市公司制度', '其它重大事项', '董事会公告', '半年度报告摘要',
               '半年度报告', '交易', '澄清、风险提示、业绩预告事项', '股权变动', '权益分派与限制出售股份上市',
               '监管措施_监管函', '中介机构报告', '增发', '股东大会', '监事会公告', '债券公告',
               '其它融资', '一季度报告', '权益分派及限制出售股份上市', '年度报告', '投资者关系活动',
               '监管问询', '三季度报告', '可转换债券', '权证相关公告', '首次公开发行及上市']

def main():
    for line in REPORT_CATEGORY:
        print line

if __name__ == '__main__':
    main()